GComPI-IFPB/openmote-fw/platform/cc2650/inc/hw_adi_0_rf.h
/******************************************************************************
*  Filename:       hw_adi_0_rf.h
*  Revised:        2015-01-15 18:41:47 +0100 (to, 15 jan 2015)
*  Revision:       42400
*
* Copyright (c) 2015, Texas Instruments Incorporated
* All rights reserved.
*
* Redistribution and use in source and binary forms, with or without
* modification, are permitted provided that the following conditions are met:
*
* 1) Redistributions of source code must retain the above copyright notice,
*    this list of conditions and the following disclaimer.
*
* 2) Redistributions in binary form must reproduce the above copyright notice,
*    this list of conditions and the following disclaimer in the documentation
*    and/or other materials provided with the distribution.
*
* 3) Neither the name of the ORGANIZATION nor the names of its contributors may
*    be used to endorse or promote products derived from this software without
*    specific prior written permission.
*
* THIS SOFTWARE IS PROVIDED BY THE COPYRIGHT HOLDERS AND CONTRIBUTORS "AS IS"
* AND ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE
* IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE
* ARE DISCLAIMED. IN NO EVENT SHALL THE COPYRIGHT HOLDER OR CONTRIBUTORS BE
* LIABLE FOR ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR
* CONSEQUENTIAL DAMAGES (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF
* SUBSTITUTE GOODS OR SERVICES; LOSS OF USE, DATA, OR PROFITS; OR BUSINESS
* INTERRUPTION) HOWEVER CAUSED AND ON ANY THEORY OF LIABILITY, WHETHER IN
* CONTRACT, STRICT LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE)
* ARISING IN ANY WAY OUT OF THE USE OF THIS SOFTWARE, EVEN IF ADVISED OF THE
* POSSIBILITY OF SUCH DAMAGE.
*
******************************************************************************/

#ifndef __HW_ADI_0_RF_H__
#define __HW_ADI_0_RF_H__


//*****************************************************************************
//
// This section defines the register offsets of
// ADI_0_RF component
//
//*****************************************************************************
// LNA and Antenna Diversity Control
#define ADI_0_RF_O_LNACTL0                                          0x00000000

// LNA Gain and Input Device Control
#define ADI_0_RF_O_LNACTL1                                          0x00000001

// LNA Bias and RXTX Pin Control
#define ADI_0_RF_O_LNACTL2                                          0x00000002

// IFAMP Control
#define ADI_0_RF_O_IFAMPCTL0                                        0x00000003

// IFAMP Gain Control
#define ADI_0_RF_O_IFAMPCTL1                                        0x00000004

// IFAMP Output Attenuation Control
#define ADI_0_RF_O_IFAMPCTL2                                        0x00000005

// PA Control
#define ADI_0_RF_O_PACTL0                                           0x00000006

// PA Gain and Power Control
#define ADI_0_RF_O_PACTL1                                           0x00000007

// PA Antenna Diversity Control
#define ADI_0_RF_O_PACTL2                                           0x00000008

// RFLDO Control
#define ADI_0_RF_O_RFLDO0                                           0x00000009

// RFLDO Output Trim
#define ADI_0_RF_O_RFLDO1                                           0x0000000A

// RFLDO Compensation Trim
#define ADI_0_RF_O_RFLDO2                                           0x0000000B

// Intermediate Frequency ADC Trim and Configuration
#define ADI_0_RF_O_IFADCCTL0                                        0x0000000C

// Intermediate Frequency ADC Trim and Configuration
#define ADI_0_RF_O_IFADCLFCFG0                                      0x0000000D

// Intermediate Frequency ADC Trim and Configuration
#define ADI_0_RF_O_IFADCLFCFG1                                      0x0000000E

// Intermediate Frequency ADC Ttrim and Configuration
#define ADI_0_RF_O_IFADCDAC                                         0x0000000F

// IFADC Quantizer Trim and Control
#define ADI_0_RF_O_IFADCQUANT0                                      0x00000010

// Intermediate Frequency ADC Trim and Configuration
#define ADI_0_RF_O_IFADCCTL1                                        0x00000012

// Intermediate Frequency ADC Configuration
#define ADI_0_RF_O_IFADCCTL2                                        0x00000013

// IFADC Analog Supply LDO
#define ADI_0_RF_O_IFALDO1                                          0x00000018

// IFADC Analog Supply LDO
#define ADI_0_RF_O_IFALDO2                                          0x00000019

// IFADC Analog Supply LDO
#define ADI_0_RF_O_IFALDO3                                          0x0000001A

// IFADC Digital Supply LDO
#define ADI_0_RF_O_IFDLDO1                                          0x0000001B

// IFADC Digital Supply LDO
#define ADI_0_RF_O_IFDLDO2                                          0x0000001C

// IFADC Digital Supply LDO
#define ADI_0_RF_O_IFDLDO3                                          0x0000001D

// IFAMP Bias Current Control
#define ADI_0_RF_O_IFAMPCTL3                                        0x0000001E

// Status
#define ADI_0_RF_O_STAT                                             0x0000001F

//*****************************************************************************
//
// Register: ADI_0_RF_O_LNACTL0
//
//*****************************************************************************
// Field: [7:4] MIX_AD
//
// Antenna diversity control in mixers.
// Other bit combinations than the enumerated ones are illegal.
// ENUMs:
// MIX_DIFF_MODE        Differential mode.
// MIX_SE_RFP           I-channel and Q-channel mixers are single balanced and
// connected to RFP LNA.
// MIX_SE_RFN           I-channel and Q-channel mixers are single balanced and
// connected to RFN LNA.
//
#define ADI_0_RF_LNACTL0_MIX_AD_M                                   0x000000F0
#define ADI_0_RF_LNACTL0_MIX_AD_S                                   4
#define ADI_0_RF_LNACTL0_MIX_AD_MIX_DIFF_MODE                       0x00000000
#define ADI_0_RF_LNACTL0_MIX_AD_MIX_SE_RFP                          0x00000050
#define ADI_0_RF_LNACTL0_MIX_AD_MIX_SE_RFN                          0x000000A0

// Field: [3:2] LNA_AD
//
// Antenna diversity control.
// Other bit combinations than the enumerated ones are not allowed.
// ENUMs:
// LNA_DIFF_MODE        LNA is in differential mode and utilizes RFP and RFN.
// LNA_SE_RFP           LNA is single ended and connected to RFP.
// LNA_SE_RFN           LNA is single ended and connected to RFN.
//
#define ADI_0_RF_LNACTL0_LNA_AD_M                                   0x0000000C
#define ADI_0_RF_LNACTL0_LNA_AD_S                                   2
#define ADI_0_RF_LNACTL0_LNA_AD_LNA_DIFF_MODE                       0x00000000
#define ADI_0_RF_LNACTL0_LNA_AD_LNA_SE_RFP                          0x00000004
#define ADI_0_RF_LNACTL0_LNA_AD_LNA_SE_RFN                          0x00000008

// Field: [1]    BIAS_DIS
//
// Disable dummy bias current.
//
// 0: Dummy bias current on (Default)
// 1: Dummy bias current off
//
//
#define ADI_0_RF_LNACTL0_BIAS_DIS                                   0x00000002
#define ADI_0_RF_LNACTL0_BIAS_DIS_BITN                              1
#define ADI_0_RF_LNACTL0_BIAS_DIS_M                                 0x00000002
#define ADI_0_RF_LNACTL0_BIAS_DIS_S                                 1

// Field: [0]    EN
//
// LNA enable signal.
// ENUMs:
// DIS                  Disable
// EN                   Enable
//
#define ADI_0_RF_LNACTL0_EN                                         0x00000001
#define ADI_0_RF_LNACTL0_EN_BITN                                    0
#define ADI_0_RF_LNACTL0_EN_M                                       0x00000001
#define ADI_0_RF_LNACTL0_EN_S                                       0
#define ADI_0_RF_LNACTL0_EN_DIS                                     0x00000000
#define ADI_0_RF_LNACTL0_EN_EN                                      0x00000001

//*****************************************************************************
//
// Register: ADI_0_RF_O_LNACTL1
//
//*****************************************************************************
// Field: [5:4] DEV_CTL
//
// LNA input device control.
//
// 00: Half of input devices on with capacitor cross coupling. Default setting
// in differential mode. See LNACTL0.LNA_AD.
// 01: All devices on with capacitor cross coupling to half the devices.
// 10: All devices on, no cross coupling. Default setting in single ended mode.
// 11:  1/4 of input devices on, no cross coupling, gain is reduced by 3dB
// compared to '00' setting. Part of AGC when using differential mode.
#define ADI_0_RF_LNACTL1_DEV_CTL_M                                  0x00000030
#define ADI_0_RF_LNACTL1_DEV_CTL_S                                  4

