GComPI-IFPB/openmote-fw/platform/cc2650/inc/hw_adi_0_rf.h
// Field: [3:0] GAIN
//
// LNA gain control. Thermometer encoded.
//
// All other values are not supported.
// ENUMs:
// MAX_MINUS_12         LNA gain set to -12 dB
// MAX_MINUS_9          LNA gain set to -9 dB
// MAX_MINUS_6          LNA gain set to -6 dB
// MAX_MINUS_3          LNA gain set to -3 dB
// MAX                  LNA gain set to 0 dB
//
#define ADI_0_RF_LNACTL1_GAIN_M                                     0x0000000F
#define ADI_0_RF_LNACTL1_GAIN_S                                     0
#define ADI_0_RF_LNACTL1_GAIN_MAX_MINUS_12                          0x00000000
#define ADI_0_RF_LNACTL1_GAIN_MAX_MINUS_9                           0x00000001
#define ADI_0_RF_LNACTL1_GAIN_MAX_MINUS_6                           0x00000003
#define ADI_0_RF_LNACTL1_GAIN_MAX_MINUS_3                           0x00000007
#define ADI_0_RF_LNACTL1_GAIN_MAX                                   0x0000000F

//*****************************************************************************
//
// Register: ADI_0_RF_O_LNACTL2
//
//*****************************************************************************
// Field: [7:6] RXTX_PIN
//
// Control of  RXTX pin. TheRXTXpin is used when LNA uses external bias. See
// LNACTL2.EXT_BIAS.
//
// 00: RXTXpin = 0 (RX)
// 01: RXTXpin = high impedance (TX)
// 10: RXTXpin = 0
// 11: RXTXpin = 1
#define ADI_0_RF_LNACTL2_RXTX_PIN_M                                 0x000000C0
#define ADI_0_RF_LNACTL2_RXTX_PIN_S                                 6

// Field: [4]    EXT_BIAS
//
// LNA bias method
//
// 0: LNA is biased with internal resistors.
// 1: LNA is biased externally through balun.
#define ADI_0_RF_LNACTL2_EXT_BIAS                                   0x00000010
#define ADI_0_RF_LNACTL2_EXT_BIAS_BITN                              4
#define ADI_0_RF_LNACTL2_EXT_BIAS_M                                 0x00000010
#define ADI_0_RF_LNACTL2_EXT_BIAS_S                                 4

// Field: [3:0] IB
//
// LNA bias current control. Linear steps. Will be trimmed in production test.
//
// 0x0: Minimum
// 0xF: Maximum
#define ADI_0_RF_LNACTL2_IB_M                                       0x0000000F
#define ADI_0_RF_LNACTL2_IB_S                                       0

//*****************************************************************************
//
// Register: ADI_0_RF_O_IFAMPCTL0
//
//*****************************************************************************
// Field: [7:3] TRIM
//
// Trim bits for IFAMP gain. The trim circuit consist of a binary weighted resistor
// ladder which gives a non-linear gain versus bit value curve.
//
// 0x00: Max gain (default setting)
// 0x1F: Min gain
#define ADI_0_RF_IFAMPCTL0_TRIM_M                                   0x000000F8
#define ADI_0_RF_IFAMPCTL0_TRIM_S                                   3

// Field: [2]    BIAS_DIS
//
// Disable dummy bias current.
//
// 0: Dummy bias current on (Default)
// 1: Dummy bias current off
//
//
#define ADI_0_RF_IFAMPCTL0_BIAS_DIS                                 0x00000004
#define ADI_0_RF_IFAMPCTL0_BIAS_DIS_BITN                            2
#define ADI_0_RF_IFAMPCTL0_BIAS_DIS_M                               0x00000004
#define ADI_0_RF_IFAMPCTL0_BIAS_DIS_S                               2

// Field: [1]    EN_Q
//
// Q-channel IFAMP enable signal
// ENUMs:
// DIS                  Disable
// EN                   Enable
//
#define ADI_0_RF_IFAMPCTL0_EN_Q                                     0x00000002
#define ADI_0_RF_IFAMPCTL0_EN_Q_BITN                                1
#define ADI_0_RF_IFAMPCTL0_EN_Q_M                                   0x00000002
#define ADI_0_RF_IFAMPCTL0_EN_Q_S                                   1
#define ADI_0_RF_IFAMPCTL0_EN_Q_DIS                                 0x00000000
#define ADI_0_RF_IFAMPCTL0_EN_Q_EN                                  0x00000002

// Field: [0]    EN_I
//
// I-channel IFAMP enable signal
// ENUMs:
// DIS                  Disable
// EN                   Enable
//
#define ADI_0_RF_IFAMPCTL0_EN_I                                     0x00000001
#define ADI_0_RF_IFAMPCTL0_EN_I_BITN                                0
#define ADI_0_RF_IFAMPCTL0_EN_I_M                                   0x00000001
#define ADI_0_RF_IFAMPCTL0_EN_I_S                                   0
#define ADI_0_RF_IFAMPCTL0_EN_I_DIS                                 0x00000000
#define ADI_0_RF_IFAMPCTL0_EN_I_EN                                  0x00000001

//*****************************************************************************
//
// Register: ADI_0_RF_O_IFAMPCTL1
//
//*****************************************************************************
// Field: [5:0] GAIN
//
// IFAMP gain control. Thermometer encoded.
//
// 0x00: Min gain (Max - 18.0dB)
// 0x01: Max gain - 15.0dB
// 0x03: Max gain - 12.0dB
// 0x07: Max gain - 9.0dB
// 0x0F: Max gain - 6.0dB
// 0x1F: Max gain - 3.0dB
// 0x3F: Max gain
//
// All other values are not supported.
// ENUMs:
// MAX_MINUS_18         IFAMP gain set to maximum -18 dB
// MAX_MINUS_15         IFAMP gain set to maximum -15 dB
// MAX_MINUS_12         IFAMP gain set to maximum -12 dB
// MAX_MINUS_9          IFAMP gain set to maximum -9 dB
// MAX_MINUS_6          IFAMP gain set to maximum -6 dB
// MAX_MINUS_3          IFAMP gain set to maximum -3 dB
// MAX                  IFAMP gain set to maximum
//
#define ADI_0_RF_IFAMPCTL1_GAIN_M                                   0x0000003F
#define ADI_0_RF_IFAMPCTL1_GAIN_S                                   0
#define ADI_0_RF_IFAMPCTL1_GAIN_MAX_MINUS_18                        0x00000000
#define ADI_0_RF_IFAMPCTL1_GAIN_MAX_MINUS_15                        0x00000001
#define ADI_0_RF_IFAMPCTL1_GAIN_MAX_MINUS_12                        0x00000003
#define ADI_0_RF_IFAMPCTL1_GAIN_MAX_MINUS_9                         0x00000007
#define ADI_0_RF_IFAMPCTL1_GAIN_MAX_MINUS_6                         0x0000000F
#define ADI_0_RF_IFAMPCTL1_GAIN_MAX_MINUS_3                         0x0000001F
#define ADI_0_RF_IFAMPCTL1_GAIN_MAX                                 0x0000003F

//*****************************************************************************
//
// Register: ADI_0_RF_O_IFAMPCTL2
//
//*****************************************************************************
// Field: [2:0] ATTN
//
// IFAMP output attenuation control in 3 dB steps
// ENUMs:
// MIN                  0 dB
// MINUS_3              -3 dB
// MINUS_6              -6 dB
// MINUS_9              -9 dB
// MINUS_12             -12 dB
// MINUS_15             -15 dB
// MINUS_18             -18 dB
// MINUS_21             -21 dB
//
#define ADI_0_RF_IFAMPCTL2_ATTN_M                                   0x00000007
#define ADI_0_RF_IFAMPCTL2_ATTN_S                                   0
#define ADI_0_RF_IFAMPCTL2_ATTN_MIN                                 0x00000000
#define ADI_0_RF_IFAMPCTL2_ATTN_MINUS_3                             0x00000001
#define ADI_0_RF_IFAMPCTL2_ATTN_MINUS_6                             0x00000002
#define ADI_0_RF_IFAMPCTL2_ATTN_MINUS_9                             0x00000003
#define ADI_0_RF_IFAMPCTL2_ATTN_MINUS_12                            0x00000004
#define ADI_0_RF_IFAMPCTL2_ATTN_MINUS_15                            0x00000005
#define ADI_0_RF_IFAMPCTL2_ATTN_MINUS_18                            0x00000006
#define ADI_0_RF_IFAMPCTL2_ATTN_MINUS_21                            0x00000007

//*****************************************************************************
//
// Register: ADI_0_RF_O_PACTL0
//
//*****************************************************************************
// Field: [7:3] TRIM
//
// Trim of bias current to get constant output power over process and temperature.
// Will be trimmed in production test.
//
// 0x00: Minimum
// 0x1F: Maximum
#define ADI_0_RF_PACTL0_TRIM_M                                      0x000000F8
#define ADI_0_RF_PACTL0_TRIM_S                                      3

