GComPI-IFPB/openmote-fw/platform/cc2650/inc/hw_adi_0_rf.h
// Field: [2]    PEAKDET_EN
//
// PA peakdetect circuit enable signal.
// ENUMs:
// DIS                  Disable
// EN                   Enable
//
#define ADI_0_RF_PACTL0_PEAKDET_EN                                  0x00000004
#define ADI_0_RF_PACTL0_PEAKDET_EN_BITN                             2
#define ADI_0_RF_PACTL0_PEAKDET_EN_M                                0x00000004
#define ADI_0_RF_PACTL0_PEAKDET_EN_S                                2
#define ADI_0_RF_PACTL0_PEAKDET_EN_DIS                              0x00000000
#define ADI_0_RF_PACTL0_PEAKDET_EN_EN                               0x00000004

// Field: [1]    BIAS_DIS
//
// Disable dummy bias current.
//
// 0: Dummy bias current on (Default)
// 1: Dummy bias current off
//
//
#define ADI_0_RF_PACTL0_BIAS_DIS                                    0x00000002
#define ADI_0_RF_PACTL0_BIAS_DIS_BITN                               1
#define ADI_0_RF_PACTL0_BIAS_DIS_M                                  0x00000002
#define ADI_0_RF_PACTL0_BIAS_DIS_S                                  1

// Field: [0]    EN
//
// PA enable signal.
// ENUMs:
// DIS                  Disable
// EN                   Enable
//
#define ADI_0_RF_PACTL0_EN                                          0x00000001
#define ADI_0_RF_PACTL0_EN_BITN                                     0
#define ADI_0_RF_PACTL0_EN_M                                        0x00000001
#define ADI_0_RF_PACTL0_EN_S                                        0
#define ADI_0_RF_PACTL0_EN_DIS                                      0x00000000
#define ADI_0_RF_PACTL0_EN_EN                                       0x00000001

//*****************************************************************************
//
// Register: ADI_0_RF_O_PACTL1
//
//*****************************************************************************
// Field: [7:6] GAIN
//
// Gain control in PA 1st stage.
//
// x0: Max gain
// 01: Lower gain
// 11: Min gain
#define ADI_0_RF_PACTL1_GAIN_M                                      0x000000C0
#define ADI_0_RF_PACTL1_GAIN_S                                      6

// Field: [5:0] IB
//
// PA output power control
//
// 0x00: Min output power
// 0x3F: Max output power
//
//
#define ADI_0_RF_PACTL1_IB_M                                        0x0000003F
#define ADI_0_RF_PACTL1_IB_S                                        0

//*****************************************************************************
//
// Register: ADI_0_RF_O_PACTL2
//
//*****************************************************************************
// Field: [7:5] RXTX
//
// Control of RFP and RFN when used to control external range extender device. (ie.
// If RFP is used as a single ended RF input, RFN is available to be used as a
// control output)
//
// 0x0: Default
// 0x2: RFP is low
// 0x3: RFP is high (1.4V)
// 0x6: RFN is low
// 0x7: RFN is high (1.4V)
//
// Other bit combinations are not valid.
#define ADI_0_RF_PACTL2_RXTX_M                                      0x000000E0
#define ADI_0_RF_PACTL2_RXTX_S                                      5

// Field: [4:3] CM
//
// Debug / experimental registers. Do not use!
//
//
#define ADI_0_RF_PACTL2_CM_M                                        0x00000018
#define ADI_0_RF_PACTL2_CM_S                                        3

// Field: [2:0] AD
//
// When PACTL0.EN = 1:
// 000, 100: PA is differential
// 001, 101: PA is single ended and connected to RFP.
// 010, 110: PA is single ended and connected to RFN.
//
// When PACTL0.EN = 0:
// 101: RFN PA NMOS is turned on giving bias to RFP LNA when configured in
// external bias mode. Same functionality as RXTXpin.
// 110: RFP PA NMOS is turned on giving bias to RFN LNA when configured in
// external bias mode. Same functionality as RXTXpin.
//
// Other bit combinations are not valid.
#define ADI_0_RF_PACTL2_AD_M                                        0x00000007
#define ADI_0_RF_PACTL2_AD_S                                        0

//*****************************************************************************
//
// Register: ADI_0_RF_O_RFLDO0
//
//*****************************************************************************
// Field: [5]    ATEST_I_EN
//
// Enable test current (2% of pass device current) to ATEST.
// 0: Disabled
// 1: Enabled
//
//
#define ADI_0_RF_RFLDO0_ATEST_I_EN                                  0x00000020
#define ADI_0_RF_RFLDO0_ATEST_I_EN_BITN                             5
#define ADI_0_RF_RFLDO0_ATEST_I_EN_M                                0x00000020
#define ADI_0_RF_RFLDO0_ATEST_I_EN_S                                5

// Field: [4]    ATEST_V_EN
//
// Enables regulated output voltage to ATEST.
// 0: Disabled
// 1: Enabled
//
//
#define ADI_0_RF_RFLDO0_ATEST_V_EN                                  0x00000010
#define ADI_0_RF_RFLDO0_ATEST_V_EN_BITN                             4
#define ADI_0_RF_RFLDO0_ATEST_V_EN_M                                0x00000010
#define ADI_0_RF_RFLDO0_ATEST_V_EN_S                                4

// Field: [3]    BYPASS_REG_EN
//
// Bypass LDO and short VDDR to PA, LNA and Mixer. RFLDO0.EN must be 0b1 to use
// this mode.
//
// 0: Disabled
// 1: Enabled
#define ADI_0_RF_RFLDO0_BYPASS_REG_EN                               0x00000008
#define ADI_0_RF_RFLDO0_BYPASS_REG_EN_BITN                          3
#define ADI_0_RF_RFLDO0_BYPASS_REG_EN_M                             0x00000008
#define ADI_0_RF_RFLDO0_BYPASS_REG_EN_S                             3

// Field: [2]    RDY_EN
//
// Enables generation of the LDO ready signal. Read result from STAT.RF_LDO.
// RFLDO0.EN must be 0b1 in order to use this feature.
// ENUMs:
// DIS                  Disable
// EN                   Enable
//
#define ADI_0_RF_RFLDO0_RDY_EN                                      0x00000004
#define ADI_0_RF_RFLDO0_RDY_EN_BITN                                 2
#define ADI_0_RF_RFLDO0_RDY_EN_M                                    0x00000004
#define ADI_0_RF_RFLDO0_RDY_EN_S                                    2
#define ADI_0_RF_RFLDO0_RDY_EN_DIS                                  0x00000000
#define ADI_0_RF_RFLDO0_RDY_EN_EN                                   0x00000004

// Field: [1]    BIAS_DIS
//
// Disable dummy bias current.
//
// 0: Dummy bias current on (Default)
// 1: Dummy bias current off
//
//
// ENUMs:
// EN                   Enable
// DIS                  Disable
//
#define ADI_0_RF_RFLDO0_BIAS_DIS                                    0x00000002
#define ADI_0_RF_RFLDO0_BIAS_DIS_BITN                               1
#define ADI_0_RF_RFLDO0_BIAS_DIS_M                                  0x00000002
#define ADI_0_RF_RFLDO0_BIAS_DIS_S                                  1
#define ADI_0_RF_RFLDO0_BIAS_DIS_EN                                 0x00000000
#define ADI_0_RF_RFLDO0_BIAS_DIS_DIS                                0x00000002

// Field: [0]    EN
//
// Enable signal for RFLDO. Powers PA, LNA and Mixer
// ENUMs:
// DIS                  Disable
// EN                   Enable
//
#define ADI_0_RF_RFLDO0_EN                                          0x00000001
#define ADI_0_RF_RFLDO0_EN_BITN                                     0
#define ADI_0_RF_RFLDO0_EN_M                                        0x00000001
#define ADI_0_RF_RFLDO0_EN_S                                        0
#define ADI_0_RF_RFLDO0_EN_DIS                                      0x00000000
#define ADI_0_RF_RFLDO0_EN_EN                                       0x00000001

//*****************************************************************************
//
// Register: ADI_0_RF_O_RFLDO1
//
//*****************************************************************************
// Field: [6:0] TRIM_OUT
//
// Trims output voltage in steps of approximately 5mV linear steps.
// The trim is unsigned and uncentered.
//
// 0x00: ~893 mV (Minimum Output Voltage)
// 0x01: ~897 mV
// ...
// 0x68: ~1.40 V (Target Value)
// 0x3F: ~1.52 V (Maximum Value)
//
// RFLDO0.ATEST_V_EN is needed for trimming.
//
//
#define ADI_0_RF_RFLDO1_TRIM_OUT_M                                  0x0000007F
#define ADI_0_RF_RFLDO1_TRIM_OUT_S                                  0

//*****************************************************************************
//
// Register: ADI_0_RF_O_RFLDO2
//
//*****************************************************************************
// Field: [5:3] COMP_RES
//
// Trim compensation resistor in series with Miller cap in nonlinear steps. Default
// should be 0x1. Unsigned number.
//
// 0x0: 1066 ohms (Minimum Resistance)
// 0x1: 1230 ohms (Default)
// 0x2: 1454 ohms
// 0x3: 1777 ohms
// 0x4: 2285 ohms
// 0x5: 3200 ohms
// 0x6: 5333 ohms
// 0x7: 16000 ohms (Maximum Resistance)
#define ADI_0_RF_RFLDO2_COMP_RES_M                                  0x00000038
#define ADI_0_RF_RFLDO2_COMP_RES_S                                  3

// Field: [2:0] COMP_CAP
//
// Trim compensation Miller cap in linear steps of 0.5 pF. Default should be 0x6.
// Unsigned number.
//
// 0x0: 3.5 pF (Maximum Capacitance)
// 0x1: 3.0 pF
// ...
// 0x6: 0.5 pF (Default)
// 0x7: Open Circuit / No Capacitance / No Compensation (regardless of
// COMP_RES setting)
//
#define ADI_0_RF_RFLDO2_COMP_CAP_M                                  0x00000007
#define ADI_0_RF_RFLDO2_COMP_CAP_S                                  0

//*****************************************************************************
//
// Register: ADI_0_RF_O_IFADCCTL0
//
//*****************************************************************************
// Field: [7:4] INT2ADJ
//
// Adjust integrator 2 gain, given by gm/C. The list below indicates the resulting
// gm while C is fixed (~235fF).  Note MSB signifies high power (1) vs. Low power
// (0) mode.
//
// 0x0: 27.8 uS
// 0x1: 26.0 uS
// 0x2: 24.0 uS
// 0x3: 22.7 uS
// 0x4: 21.2 uS
// 0x5: 20.1 uS
// 0x6: 18.9 uS
// 0x7: 18.1 uS
// 0x8: 32.0 uS
// 0x9: 29.6 uS
// 0xA: 27.1 uS
// 0xB: 25.4 uS
// 0xC: 23.6 uS
// 0xD: 22.3 uS (Default)
// 0xE: 20.8 uS
// 0xF: 19.8 uS
#define ADI_0_RF_IFADCCTL0_INT2ADJ_M                                0x000000F0
#define ADI_0_RF_IFADCCTL0_INT2ADJ_S                                4

// Field: [3:2] AAFCAP
//
// Adjust AAF damping
// Nominal fc (Mag = -3dB)
//
// 0: 6.49 MHz
// 1: 5.31 MHz
// 2: 4.49 MHz
// 3: 3.59 MHz (Default)
#define ADI_0_RF_IFADCCTL0_AAFCAP_M                                 0x0000000C
#define ADI_0_RF_IFADCCTL0_AAFCAP_S                                 2

// Field: [1]    BIAS_DIS
//
// Disable dummy bias current.
//
// 0: Dummy bias current on (Default)
// 1: Dummy bias current off
//
//
// ENUMs:
// EN                   Enable (default)
// DIS                  Disable
//
#define ADI_0_RF_IFADCCTL0_BIAS_DIS                                 0x00000002
#define ADI_0_RF_IFADCCTL0_BIAS_DIS_BITN                            1
#define ADI_0_RF_IFADCCTL0_BIAS_DIS_M                               0x00000002
#define ADI_0_RF_IFADCCTL0_BIAS_DIS_S                               1
#define ADI_0_RF_IFADCCTL0_BIAS_DIS_EN                              0x00000000
#define ADI_0_RF_IFADCCTL0_BIAS_DIS_DIS                             0x00000002

//*****************************************************************************
//
// Register: ADI_0_RF_O_IFADCLFCFG0
//
//*****************************************************************************
// Field: [7:4] FF1ADJ
//
// Adjust FF1 gain (transconductance/gm from first integrator into quantizer), note
// MSB signifies high power (1) vs. Low power (0) mode.
//
// 0x0: 23.8 uS - Default
// 0x1: 22.3 uS
// 0x2: 20.6 uS
// 0x3: 19.5 us
// 0x4: 18.1 uS
// 0x5: 17.2 uS
// 0x6: 16.2 uS
// 0x7: 15.5 uS
// 0x8: 27.2 uS
// 0x9: 25.2 uS
// 0xA: 23.1 uS
// 0xB: 21.6 uS
// 0xC: 20.0 uS
// 0xD: 18.9 uS
// 0xE: 17.7 uS
// 0xF: 16.8 uS
#define ADI_0_RF_IFADCLFCFG0_FF1ADJ_M                               0x000000F0
#define ADI_0_RF_IFADCLFCFG0_FF1ADJ_S                               4

// Field: [3:0] INT3ADJ
//
// Adjust integrator 3 gain, see
// IFADCCTL0.INT2ADJ for valid trim values
// Default value, 0x6
#define ADI_0_RF_IFADCLFCFG0_INT3ADJ_M                              0x0000000F
#define ADI_0_RF_IFADCLFCFG0_INT3ADJ_S                              0

//*****************************************************************************
//
// Register: ADI_0_RF_O_IFADCLFCFG1
//
//*****************************************************************************
// Field: [7:4] FF3ADJ
//
// Adjust FF3 gain (transconductance/gm from third integrator into quantizer). See
// IFADCLFCFG0.FF1ADJ for values. Default value is 0x4
#define ADI_0_RF_IFADCLFCFG1_FF3ADJ_M                               0x000000F0
#define ADI_0_RF_IFADCLFCFG1_FF3ADJ_S                               4

// Field: [3:0] FF2ADJ
//
// Adjust FF2 gain (transconductance/gm from second integrator into quantizer). See
// IFADCLFCFG0.FF1ADJ for values. Default value is 0x3
#define ADI_0_RF_IFADCLFCFG1_FF2ADJ_M                               0x0000000F
#define ADI_0_RF_IFADCLFCFG1_FF2ADJ_S                               0

//*****************************************************************************
//
// Register: ADI_0_RF_O_IFADCDAC
//
//*****************************************************************************
// Field: [7]    MODE
//
// Selects DAC return to zero mode
// ENUMs:
// NRTZ                 NRTZ enabled. Default
// RTZ                  RTZ enabled
//
#define ADI_0_RF_IFADCDAC_MODE                                      0x00000080
#define ADI_0_RF_IFADCDAC_MODE_BITN                                 7
#define ADI_0_RF_IFADCDAC_MODE_M                                    0x00000080
#define ADI_0_RF_IFADCDAC_MODE_S                                    7
#define ADI_0_RF_IFADCDAC_MODE_NRTZ                                 0x00000000
#define ADI_0_RF_IFADCDAC_MODE_RTZ                                  0x00000080

// Field: [6:1] TRIM
//
// Trim feedback-DAC current in uA. Increasing this current will give a more
// aggressive noise shaping but it also reduce the gain into the IFADC.
//
// 0x00: 0.00 uA
// 0x01: 0.83 uA
// 0x02: 1.66 uA
// 0x03: 2.50 uA
// 0x04: 3.33 uA
// 0x05: 4.17 uA
// 0x06: 5.00 uA
// 0x07: 5.83 uA
// 0x08: 6.67 uA
// 0x09: 7.50 uA
// 0x0A: 8.33 uA
// 0x0B: 9.17 uA
// 0x0C: 10.00 uA
// 0x0D: 10.83 uA - Default
// 0x0E: 11.67 uA
// 0x0F: 12.50 uA
// 0x10: 13.33 uA
// 0x11: 14.17 uA
// 0x12:  15.00 uA
// 0x13:  15.83 uA
// 0x14:  16.67 uA
// 0x15:  17.50 uA
// 0x16:  18.33 uA
// 0x17:  19.17 uA
// 0x18:  20.00 uA
// 0x19:  20.83 uA
// 0x1A:  21.67 uA
// 0x1B:  22.50 uA
// 0x1C:  23.33 uA
// 0x1D:  24.17 uA
// 0x1E:  25.00 uA
// 0x1F:  25.83 uA
//
// Note that bit 6 is not used
#define ADI_0_RF_IFADCDAC_TRIM_M                                    0x0000007E
#define ADI_0_RF_IFADCDAC_TRIM_S                                    1

//*****************************************************************************
//
// Register: ADI_0_RF_O_IFADCQUANT0
//
//*****************************************************************************
// Field: [3]    AUTOCAL_EN
//
// Quantizer auto calibrate enable.
//
// Before this sequence is initiated the IFADCs to be used must be enabled with
// IFADCCTL1.ADCIEN and/or  IFADCCTL1.ADCQEN. Then reset digital sub-blocks with
//  IFADCCTL2.RESETN before the auto calibrate is enabled.
#define ADI_0_RF_IFADCQUANT0_AUTOCAL_EN                             0x00000008
#define ADI_0_RF_IFADCQUANT0_AUTOCAL_EN_BITN                        3
#define ADI_0_RF_IFADCQUANT0_AUTOCAL_EN_M                           0x00000008
#define ADI_0_RF_IFADCQUANT0_AUTOCAL_EN_S                           3

// Field: [2:0] TH
//
// Threshold adjust for quantizer. NOM is ~25mV.
//
// 0: Single threshold
// 1: NOM * 1/4
// 2: NOM * 2/4
// 3: NOM * 3/4
// 4: NOM
// 5: NOM * 5/4 - Default
// 6: NOM * 6/4
// 7: NOM * 7/4
#define ADI_0_RF_IFADCQUANT0_TH_M                                   0x00000007
#define ADI_0_RF_IFADCQUANT0_TH_S                                   0

//*****************************************************************************
//
// Register: ADI_0_RF_O_IFADCCTL1
//
//*****************************************************************************
// Field: [7:5] DITHERTRIM
//
// Adjust dither output current
//
// 0: 250.0 nA (Default)
// 1: 500.0 nA
// 2: 749.8 nA
// 3: 999.7 nA
// 4: 1249 nA
// 5: 1499 nA
// 6: 1749 nA
// 7: 1999 nA
#define ADI_0_RF_IFADCCTL1_DITHERTRIM_M                             0x000000E0
#define ADI_0_RF_IFADCCTL1_DITHERTRIM_S                             5

// Field: [4]    ADCIEN
//
// Enable I-channel IFADC
//
// ENUMs:
// DIS                  Disable
// EN                   Enable
//
#define ADI_0_RF_IFADCCTL1_ADCIEN                                   0x00000010
#define ADI_0_RF_IFADCCTL1_ADCIEN_BITN                              4
#define ADI_0_RF_IFADCCTL1_ADCIEN_M                                 0x00000010
#define ADI_0_RF_IFADCCTL1_ADCIEN_S                                 4
#define ADI_0_RF_IFADCCTL1_ADCIEN_DIS                               0x00000000
#define ADI_0_RF_IFADCCTL1_ADCIEN_EN                                0x00000010

// Field: [3]    ADCQEN
//
// Enable Q-channel IFADC
//
// ENUMs:
// DIS                  Disable
// EN                   Enable
//
#define ADI_0_RF_IFADCCTL1_ADCQEN                                   0x00000008
#define ADI_0_RF_IFADCCTL1_ADCQEN_BITN                              3
#define ADI_0_RF_IFADCCTL1_ADCQEN_M                                 0x00000008
#define ADI_0_RF_IFADCCTL1_ADCQEN_S                                 3
#define ADI_0_RF_IFADCCTL1_ADCQEN_DIS                               0x00000000
#define ADI_0_RF_IFADCCTL1_ADCQEN_EN                                0x00000008

// Field: [2:1] DITHEREN
//
// Dither algorithm select.
//
// This register is also used for integrity check of IFADC output test modes
// (IFADCCTL2.ADCLFSROUTEN=1). IFADC output bits in test mode is combined as
// following:
//
// IFADC output Q[1:0] = 10 (static) and IFADC output  I[1:0] is configured
// according to the list below (the right side is the resulting IFADC output):
//
// 0: 00
// 1: PRBS2d 0
// 2: 0 PRBS2
// 3: PRBS2d PRBS2
//
//
// ENUMs:
// DIS                  Disable dither (Default)
// ENS                  Single pseudo random sequence, white dither
// ENSD                 White noise dither, double power (same sequence on both
// outputs)
// ENG                  Gaussian dither, two different pseudo random sequences
// combined
//
#define ADI_0_RF_IFADCCTL1_DITHEREN_M                               0x00000006
#define ADI_0_RF_IFADCCTL1_DITHEREN_S                               1
#define ADI_0_RF_IFADCCTL1_DITHEREN_DIS                             0x00000000
#define ADI_0_RF_IFADCCTL1_DITHEREN_ENS                             0x00000002
#define ADI_0_RF_IFADCCTL1_DITHEREN_ENSD                            0x00000004
#define ADI_0_RF_IFADCCTL1_DITHEREN_ENG                             0x00000006

//*****************************************************************************
//
// Register: ADI_0_RF_O_IFADCCTL2
//
//*****************************************************************************
// Field: [7]    RESETN
//
// Reset all digital blocks (active low).
// Must be done after the IFADC has been enabled to reset digital sub-IP. First
// enable the IFADC withIFADCCTL1.ADCIEN and/or  IFADCCTL1.ADCQEN. Then reset
// the device by pulling the signal low for at least one clock cycle, then back
// high.
// ENUMs:
// EN                   Disable
// DIS                  Enable (default)
//
#define ADI_0_RF_IFADCCTL2_RESETN                                   0x00000080
#define ADI_0_RF_IFADCCTL2_RESETN_BITN                              7
#define ADI_0_RF_IFADCCTL2_RESETN_M                                 0x00000080
#define ADI_0_RF_IFADCCTL2_RESETN_S                                 7
#define ADI_0_RF_IFADCCTL2_RESETN_EN                                0x00000000
#define ADI_0_RF_IFADCCTL2_RESETN_DIS                               0x00000080

// Field: [6]    CLKGENEN
//
// Enable clock generator module
// ENUMs:
// DIS                  Disable
// EN                   Enable (default)
//
#define ADI_0_RF_IFADCCTL2_CLKGENEN                                 0x00000040
#define ADI_0_RF_IFADCCTL2_CLKGENEN_BITN                            6
#define ADI_0_RF_IFADCCTL2_CLKGENEN_M                               0x00000040
#define ADI_0_RF_IFADCCTL2_CLKGENEN_S                               6
#define ADI_0_RF_IFADCCTL2_CLKGENEN_DIS                             0x00000000
#define ADI_0_RF_IFADCCTL2_CLKGENEN_EN                              0x00000040

// Field: [5]    ADCDIGCLKEN
//
// Enable clock output from IFADC to decimator
//
// ENUMs:
// DIS                  Disable
// EN                   Enable (default)
//
#define ADI_0_RF_IFADCCTL2_ADCDIGCLKEN                              0x00000020
#define ADI_0_RF_IFADCCTL2_ADCDIGCLKEN_BITN                         5
#define ADI_0_RF_IFADCCTL2_ADCDIGCLKEN_M                            0x00000020
#define ADI_0_RF_IFADCCTL2_ADCDIGCLKEN_S                            5
#define ADI_0_RF_IFADCCTL2_ADCDIGCLKEN_DIS                          0x00000000
#define ADI_0_RF_IFADCCTL2_ADCDIGCLKEN_EN                           0x00000020

// Field: [1]    INVCLKOUT
//
// Control phase inversion of IFADC clock output
// ENUMs:
// DIS                  Keep default IFADC output clock phase
// EN                   Invert IFADC output clock phase (default)
//
#define ADI_0_RF_IFADCCTL2_INVCLKOUT                                0x00000002
#define ADI_0_RF_IFADCCTL2_INVCLKOUT_BITN                           1
#define ADI_0_RF_IFADCCTL2_INVCLKOUT_M                              0x00000002
#define ADI_0_RF_IFADCCTL2_INVCLKOUT_S                              1
#define ADI_0_RF_IFADCCTL2_INVCLKOUT_DIS                            0x00000000
#define ADI_0_RF_IFADCCTL2_INVCLKOUT_EN                             0x00000002

//*****************************************************************************
//
// Register: ADI_0_RF_O_IFALDO1
//
//*****************************************************************************
// Field: [4]    ERR_AMP_ZERO_EN
//
// Enables a zero in the LDO error amplifier's output to improve stability at the
// cost of bandwidth.
//
// 0: Disabled (Default)
// 1: Enabled
// ENUMs:
// DIS                  Disable
// EN                   Enable
//
#define ADI_0_RF_IFALDO1_ERR_AMP_ZERO_EN                            0x00000010
#define ADI_0_RF_IFALDO1_ERR_AMP_ZERO_EN_BITN                       4
#define ADI_0_RF_IFALDO1_ERR_AMP_ZERO_EN_M                          0x00000010
#define ADI_0_RF_IFALDO1_ERR_AMP_ZERO_EN_S                          4
#define ADI_0_RF_IFALDO1_ERR_AMP_ZERO_EN_DIS                        0x00000000
#define ADI_0_RF_IFALDO1_ERR_AMP_ZERO_EN_EN                         0x00000010

// Field: [3]    BYPASS_REG_EN
//
// Bypass LDO and short VDDR on LDO output to IFADC.
//
// 0: Disabled (Default)
// 1: Enabled (IFALDO1.EN must be enabled)
#define ADI_0_RF_IFALDO1_BYPASS_REG_EN                              0x00000008
#define ADI_0_RF_IFALDO1_BYPASS_REG_EN_BITN                         3
#define ADI_0_RF_IFALDO1_BYPASS_REG_EN_M                            0x00000008
#define ADI_0_RF_IFALDO1_BYPASS_REG_EN_S                            3

