GComPI-IFPB/openmote-fw/platform/cc2650/inc/hw_adi_0_rf.h
// Field: [2]    RDY_EN
//
// Enable LDO Ready Signal. Read result in STAT.IFLDOS_RDY.
//
// 0: Disable ready signal generation circuit
// 1: Enable ready signal generation circuit (IFALDO1.EN must be enabled)
// (Default)
// ENUMs:
// DIS                  Disable
// EN                   Enable
//
#define ADI_0_RF_IFALDO1_RDY_EN                                     0x00000004
#define ADI_0_RF_IFALDO1_RDY_EN_BITN                                2
#define ADI_0_RF_IFALDO1_RDY_EN_M                                   0x00000004
#define ADI_0_RF_IFALDO1_RDY_EN_S                                   2
#define ADI_0_RF_IFALDO1_RDY_EN_DIS                                 0x00000000
#define ADI_0_RF_IFALDO1_RDY_EN_EN                                  0x00000004

// Field: [1]    BIAS_DIS
//
// Disable dummy bias current.
//
// 0: Dummy bias current on (Default)
// 1: Dummy bias current off
//
//
// ENUMs:
// EN                   Enable
// DIS                  Disable
//
#define ADI_0_RF_IFALDO1_BIAS_DIS                                   0x00000002
#define ADI_0_RF_IFALDO1_BIAS_DIS_BITN                              1
#define ADI_0_RF_IFALDO1_BIAS_DIS_M                                 0x00000002
#define ADI_0_RF_IFALDO1_BIAS_DIS_S                                 1
#define ADI_0_RF_IFALDO1_BIAS_DIS_EN                                0x00000000
#define ADI_0_RF_IFALDO1_BIAS_DIS_DIS                               0x00000002

// Field: [0]    EN
//
// Enable IFADC's regulator for analog blocks.
// ENUMs:
// DIS                  Disable
// EN                   Enable (Default)
//
#define ADI_0_RF_IFALDO1_EN                                         0x00000001
#define ADI_0_RF_IFALDO1_EN_BITN                                    0
#define ADI_0_RF_IFALDO1_EN_M                                       0x00000001
#define ADI_0_RF_IFALDO1_EN_S                                       0
#define ADI_0_RF_IFALDO1_EN_DIS                                     0x00000000
#define ADI_0_RF_IFALDO1_EN_EN                                      0x00000001

//*****************************************************************************
//
// Register: ADI_0_RF_O_IFALDO2
//
//*****************************************************************************
// Field: [7:5] COMP_CAP
//
// Trim compensation Miller cap in linear steps of 0.5 pF. Default should be 0x6.
// Unsigned. Tradeoff stability for speed.
//
// 0x0: 3.5 pF (Maximum Capacitance)
// 0x1: 3.0 pF
// ...
// 0x6: 0.5 pF (Default)
// 0x7: Open Circuit / No Capacitance / No Compensation (regardless of
// IFALDO3.COMP_RES setting)
#define ADI_0_RF_IFALDO2_COMP_CAP_M                                 0x000000E0
#define ADI_0_RF_IFALDO2_COMP_CAP_S                                 5

// Field: [4:0] TRIM_OUT
//
// Trim LDO's output voltage linearly with a signed 2's complement number. Step
// size is approximately 8 mV.
//
// 0x10: -16 : 1.324V (Minimum Voltage)
// ...
// 0x1F: -1   : 1.395V
// 0x00: +0  : 1.403V (Default)
// 0x01: +1  : 1.407V
// ...
// 0x0F:+15 : 1.474V (Maximum Voltage)
//
//
#define ADI_0_RF_IFALDO2_TRIM_OUT_M                                 0x0000001F
#define ADI_0_RF_IFALDO2_TRIM_OUT_S                                 0

//*****************************************************************************
//
// Register: ADI_0_RF_O_IFALDO3
//
//*****************************************************************************
// Field: [4]    ATEST_V_EN
//
// Enables regulated output voltage to ATEST. Used to trim the LDO.
//
// 0: Disabled
// 1: Enabled
//
//
#define ADI_0_RF_IFALDO3_ATEST_V_EN                                 0x00000010
#define ADI_0_RF_IFALDO3_ATEST_V_EN_BITN                            4
#define ADI_0_RF_IFALDO3_ATEST_V_EN_M                               0x00000010
#define ADI_0_RF_IFALDO3_ATEST_V_EN_S                               4

// Field: [3]    ATEST_I_EN
//
// Enable test current (8.33% or 1/12 of LDO load current) to ATEST.
//
// 0: Disabled
// 1: Enabled
//
//
#define ADI_0_RF_IFALDO3_ATEST_I_EN                                 0x00000008
#define ADI_0_RF_IFALDO3_ATEST_I_EN_BITN                            3
#define ADI_0_RF_IFALDO3_ATEST_I_EN_M                               0x00000008
#define ADI_0_RF_IFALDO3_ATEST_I_EN_S                               3

// Field: [2:0] COMP_RES
//
// Trim compensation resistor in series with Miller cap in nonlinear steps. Default
// should be 0x0. Unsigned number.
//
// 0x0: 1066 ohms (Minimum Resistance, Default)
// 0x1: 1230 ohms
// 0x2: 1454 ohms
// 0x3: 1777 ohms
// 0x4: 2285 ohms
// 0x5: 3200 ohms
// 0x6: 5333 ohms
// 0x7: 16000 ohms (Maximum Resistance)
#define ADI_0_RF_IFALDO3_COMP_RES_M                                 0x00000007
#define ADI_0_RF_IFALDO3_COMP_RES_S                                 0

//*****************************************************************************
//
// Register: ADI_0_RF_O_IFDLDO1
//
//*****************************************************************************
// Field: [3]    BYPASS_REG_EN
//
// Bypass LDO and short VDDR to LDO's output to ADC.
//
// 0: Disabled (Default)
// 1: Enabled
// ENUMs:
// DIS                  Disable
// EN                   Enable
//
#define ADI_0_RF_IFDLDO1_BYPASS_REG_EN                              0x00000008
#define ADI_0_RF_IFDLDO1_BYPASS_REG_EN_BITN                         3
#define ADI_0_RF_IFDLDO1_BYPASS_REG_EN_M                            0x00000008
#define ADI_0_RF_IFDLDO1_BYPASS_REG_EN_S                            3
#define ADI_0_RF_IFDLDO1_BYPASS_REG_EN_DIS                          0x00000000
#define ADI_0_RF_IFDLDO1_BYPASS_REG_EN_EN                           0x00000008

// Field: [2]    RDY_EN
//
// Enable LDO Ready Signal. Read result in STAT.IFLDOS_RDY.
//
// 0: Disable ready signal generation circuit
// 1: Enable ready signal generation circuit (IFDIGLDO_EN must be enabled)
// (Default)
// ENUMs:
// DIS                  Disable
// EN                   Enable
//
#define ADI_0_RF_IFDLDO1_RDY_EN                                     0x00000004
#define ADI_0_RF_IFDLDO1_RDY_EN_BITN                                2
#define ADI_0_RF_IFDLDO1_RDY_EN_M                                   0x00000004
#define ADI_0_RF_IFDLDO1_RDY_EN_S                                   2
#define ADI_0_RF_IFDLDO1_RDY_EN_DIS                                 0x00000000
#define ADI_0_RF_IFDLDO1_RDY_EN_EN                                  0x00000004

// Field: [1]    BIAS_DIS
//
// Disable dummy bias current.
//
// 0: Dummy bias current on (Default)
// 1: Dummy bias current off
//
//
// ENUMs:
// EN                   Enable
// DIS                  Disable
//
#define ADI_0_RF_IFDLDO1_BIAS_DIS                                   0x00000002
#define ADI_0_RF_IFDLDO1_BIAS_DIS_BITN                              1
#define ADI_0_RF_IFDLDO1_BIAS_DIS_M                                 0x00000002
#define ADI_0_RF_IFDLDO1_BIAS_DIS_S                                 1
#define ADI_0_RF_IFDLDO1_BIAS_DIS_EN                                0x00000000
#define ADI_0_RF_IFDLDO1_BIAS_DIS_DIS                               0x00000002

// Field: [0]    EN
//
// Enable IFADC LDO for digital blocks.
// ENUMs:
// DIS                  Disable
// EN                   Enable
//
#define ADI_0_RF_IFDLDO1_EN                                         0x00000001
#define ADI_0_RF_IFDLDO1_EN_BITN                                    0
#define ADI_0_RF_IFDLDO1_EN_M                                       0x00000001
#define ADI_0_RF_IFDLDO1_EN_S                                       0
#define ADI_0_RF_IFDLDO1_EN_DIS                                     0x00000000
#define ADI_0_RF_IFDLDO1_EN_EN                                      0x00000001

//*****************************************************************************
//
// Register: ADI_0_RF_O_IFDLDO2
//
//*****************************************************************************
// Field: [7:5] COMP_CAP
//
// Trim compensation Miller cap in linear steps of 0.5 pF. Default should be 0x6.
// Unsigned.
//
// 0x0: 3.5 pF (Maximum Capacitance)
// 0x1: 3.0 pF
// ...
// 0x6: 0.5 pF (Default)
// 0x7: Open Circuit / No Capacitance / No Compensation (regardless of
// IFDLDO3.COMP_RES setting)
#define ADI_0_RF_IFDLDO2_COMP_CAP_M                                 0x000000E0
#define ADI_0_RF_IFDLDO2_COMP_CAP_S                                 5

// Field: [4:0] TRIM_OUT
//
// Trim LDO's output voltage linearly with a signed 2's complement number. Step
// size is approximately 8 mV.
//
// 0x10: -16 : 1.128V (Minimum Voltage)
// ...
// 0x1F: -1   : 1.198V
// 0x00: +0  : 1.206V (Default)
// 0x01: +1  : 1.210V
// ...
// 0x0F:+15 : 1.277V (Maximum Voltage)
//
//
#define ADI_0_RF_IFDLDO2_TRIM_OUT_M                                 0x0000001F
#define ADI_0_RF_IFDLDO2_TRIM_OUT_S                                 0

//*****************************************************************************
//
// Register: ADI_0_RF_O_IFDLDO3
//
//*****************************************************************************
// Field: [4]    ATEST_V_EN
//
// Enables regulated output voltage to ATEST. Used to trim the LDO.
//
// 0: Disabled
// 1: Enabled
//
//
// ENUMs:
// DIS                  Disable
// EN                   Enable
//
#define ADI_0_RF_IFDLDO3_ATEST_V_EN                                 0x00000010
#define ADI_0_RF_IFDLDO3_ATEST_V_EN_BITN                            4
#define ADI_0_RF_IFDLDO3_ATEST_V_EN_M                               0x00000010
#define ADI_0_RF_IFDLDO3_ATEST_V_EN_S                               4
#define ADI_0_RF_IFDLDO3_ATEST_V_EN_DIS                             0x00000000
#define ADI_0_RF_IFDLDO3_ATEST_V_EN_EN                              0x00000010

