GComPI-IFPB/openmote-fw/platform/cc2650/inc/hw_adi_0_rf.h
// Field: [3]    ATEST_I_EN
//
// Enable test current (10% of LDO load current) to ATEST.
//
// 0: Disabled
// 1: Enabled
//
//
// ENUMs:
// DIS                  Disable
// EN                   Enable
//
#define ADI_0_RF_IFDLDO3_ATEST_I_EN                                 0x00000008
#define ADI_0_RF_IFDLDO3_ATEST_I_EN_BITN                            3
#define ADI_0_RF_IFDLDO3_ATEST_I_EN_M                               0x00000008
#define ADI_0_RF_IFDLDO3_ATEST_I_EN_S                               3
#define ADI_0_RF_IFDLDO3_ATEST_I_EN_DIS                             0x00000000
#define ADI_0_RF_IFDLDO3_ATEST_I_EN_EN                              0x00000008

// Field: [2:0] COMP_RES
//
// Trim compensation resistor in series with Miller cap in nonlinear steps. Default
// should be 0x0. Unsigned number.
//
// 0x0: 1066 ohms (Minimum Resistance, Default)
// 0x1: 1230 ohms
// 0x2: 1454 ohms
// 0x3: 1777 ohms
// 0x4: 2285 ohms
// 0x5: 3200 ohms
// 0x6: 5333 ohms
// 0x7: 16000 ohms (Maximum Resistance)
#define ADI_0_RF_IFDLDO3_COMP_RES_M                                 0x00000007
#define ADI_0_RF_IFDLDO3_COMP_RES_S                                 0

//*****************************************************************************
//
// Register: ADI_0_RF_O_IFAMPCTL3
//
//*****************************************************************************
// Field: [6:4] AAF_CAP_EN
//
// AAF capacitor control. Linear cap steps (ie. Non-linear BW steps)
//
// 0x0: Smallest cap, largest BW
// 0x7: Largest cap, narrowest BW
#define ADI_0_RF_IFAMPCTL3_AAF_CAP_EN_M                             0x00000070
#define ADI_0_RF_IFAMPCTL3_AAF_CAP_EN_S                             4

// Field: [3:0] IB
//
// IFAMP bias current control. Linear steps.
//
// 0x0: Min bias current
// 0x7: Default bias current
// 0xF: Max bias current
#define ADI_0_RF_IFAMPCTL3_IB_M                                     0x0000000F
#define ADI_0_RF_IFAMPCTL3_IB_S                                     0

//*****************************************************************************
//
// Register: ADI_0_RF_O_STAT
//
//*****************************************************************************
// Field: [7:3] IFADC_CALVAL_OUT
//
// Quant Cal values from either I or Q quantizer
//
// Use:
// IFADCTEST.QCALDBCSEL to select comparator,
// IFADCTEST.QCALDBIQSEL to select I/Q, and
// IFADCQUANT1.DBG_CAL_LEGSEL to select leg
#define ADI_0_RF_STAT_IFADC_CALVAL_OUT_M                            0x000000F8
#define ADI_0_RF_STAT_IFADC_CALVAL_OUT_S                            3

// Field: [2]    IFADC_CALDONE
//
// IFADC quantizer calibration done
#define ADI_0_RF_STAT_IFADC_CALDONE                                 0x00000004
#define ADI_0_RF_STAT_IFADC_CALDONE_BITN                            2
#define ADI_0_RF_STAT_IFADC_CALDONE_M                               0x00000004
#define ADI_0_RF_STAT_IFADC_CALDONE_S                               2

// Field: [1]    IFLDOS_RDY
//
// IFADC LDOs Ready (if only one is enabled the bit indicate the status of the
// enabled LDO)
//
//
#define ADI_0_RF_STAT_IFLDOS_RDY                                    0x00000002
#define ADI_0_RF_STAT_IFLDOS_RDY_BITN                               1
#define ADI_0_RF_STAT_IFLDOS_RDY_M                                  0x00000002
#define ADI_0_RF_STAT_IFLDOS_RDY_S                                  1

// Field: [0]    RF_LDO
//
// RF LDO Ready
#define ADI_0_RF_STAT_RF_LDO                                        0x00000001
#define ADI_0_RF_STAT_RF_LDO_BITN                                   0
#define ADI_0_RF_STAT_RF_LDO_M                                      0x00000001
#define ADI_0_RF_STAT_RF_LDO_S                                      0

#endif // __HW_ADI_0_RF_H__
